Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/L09.tmx
Source language: en_us
Languages: zh_cn

source: DEAD OF WINTER
zh_cn: 致命的严冬

source: The night the twins' house burned down, there was snow up to the eaves.
zh_cn: 双胞胎的房子烧毁了，那天晚上，雪堆到了屋檐。

source: It was February and everybody in town here was holed up waiting for something, anything, to happen.
zh_cn: 二月，镇上的人窝在家里，大家都盼着来点儿什么事。

source: Out in the country, the snowplows had finally gotten through after a weekend blizzard that put eighteen inches of snow on top of what was there already.
zh_cn: 周末的暴风雪下了十八英寸的雪，堆积在之前的雪层上。

source: Telephone service had gone bust.
zh_cn: 扫雪车疏通了进村的路。

source: The electricity had snapped off at 3:10 in the morning, and school had been closed down for two days.
zh_cn: 电话不通，凌晨三点十分，供电也断了，学校已经停课两天。

source: The winter was beginning to get on people's nerves.
zh_cn: 这个冬天让人心烦气躁。

source: Two perfectly good friends had got to fighting over the last box of corn flakes on the shelf at the general store, and my wife, Annie, had begun embroidering, for the third time in one winter, the North Dakota state emblem on a footstool covering.
zh_cn: 无话不说的两个朋友，为了杂货店货架上最后一盒玉米片，动起了拳脚。我的妻子安妮，在凳子的布套上绣起了北达科达州徽，入冬以来已经绣了两个了。

source: By eight o'clock that Friday night, I needed to get out of our house, even though the mercury had already sunk fifteen frets below the zero mark.
zh_cn: 那天是周五，晚上八点我要到屋外去，尽管温度计的水银柱降到了零度以下十五格。

source: "Annie, I'm going out to the garage to make sure the car warmer is plugged in," I said.
zh_cn: “安妮，我出门看看暖车器插上电没有。”我说。

source: "Just don't let in a draft, Brady," she replied from her recliner .
zh_cn: “出门别让冷风吹进来，布拉迪。”她在躺椅上说。

source: We've been married for forty years, some good, some bad.
zh_cn: 我们结婚四十年了，日子过得有好有坏。

source: Too late now to do anything about it.
zh_cn: 这个时候，想做什么都已经晚了。

source: I checked the car and then slipped out the small garage door onto the driveway for some respite.
zh_cn: 我检查完车，钻出小车库，到车道上来歇歇。

source: I was glad to see the North Star shining down Main Street in case I had to make a quick getaway- one way to get through a North Dakota winter is to dream up exciting and dangerous possibilities.
zh_cn: 我高兴地看到下面大街上空，北极星闪耀着。万一要紧急撤离会是个帮助。胡思乱想点儿既刺激又危险的事儿，是打发北达科他冬天的一个办法。

source: When I looked out to the northeast, I saw a big red glow.
zh_cn: 东北望去，一大片红光映入眼帘。

source: For a moment I thought it was the Northern Lights putting on a show, but then I knew it was a fire.
zh_cn: 我以为是出现了北极光，转念一想，那是火光。

source: And I knew it had to be the twins', Lester and Larry, since that's the only house out there for ten miles around.
zh_cn: 肯定是莱斯特、拉里双胞胎兄弟的房子着火了，方圆十英里，只有他们家的房子。

source: I skittered back inside quick.
zh_cn: 我飞快跑回屋内。

source: "There's a fire," I said to Annie.
zh_cn: “失火了。”我告诉安妮。

source: "Looks like it's the twins'.
zh_cn: “看来是双胞胎家。

source: I'm going over there to help."
zh_cn: 我去帮忙。"

source: "I'm going along," she said with that flat solid voice that means arguing will get a man nowhere.
zh_cn: “我也去。”平淡的语气透着坚定，劝她别去只会自寻烦恼。

source: "Well then," I said to her, "dress warm."
zh_cn: “那——也行。穿暖点儿。”我答。

source: "I can read a thermometer as well as the next person," she snapped back at me.
zh_cn: “温度计我也看得懂。”她呛我。

source: After that we just kept quiet while we pulled on wool socks and our heavy outer garments. We waddled to the car looking like those moon walkers.
zh_cn: 我们穿上羊毛袜、厚重的外套，没说一句话，接着一摇一摆向车走去，好像月球漫步。

source: The old Chevy started right up, and we headed out into the cold night.
zh_cn: 老爷车雪佛兰一下子就发动了，我把车开出车库冲进夜色。

source: It hadn't snowed since the big blizzard, so the road beds were clear, but there were six-foot walls of snow pushed out onto the shoulders by the snow plows.
zh_cn: 暴风雪之后没再下雪，路面很干净。扫雪车扫出的雪堆在路肩上，成了两堵墙，有六英尺高。

source: When we turned off the state road, we could see the flames and sparks shooting up into the air, even though we were still two miles away.
zh_cn: 离开州道，隔着两英里的路，就看见火光冲天、火花四溅。

source: Off in the distance, to the west, I saw the flashing lights of a fire engine making the run from over Wilton way.
zh_cn: 西边远处威尔顿路上，一辆消防车闪着警灯疾驶过来。

source: "What good's a fire engine going to do?" I said to Annie.
zh_cn: “消防车来有什么用？

source: "There's not even running water in that house."
zh_cn: 房子里又没有自来水。

source: The old man did have it piped in for the cattle, but not in the house.
zh_cn: 那老头把水接到牛棚了，没接到房子里。

source: And they just put electricity in the house a couple of years ago.
zh_cn: 房子里的电没几年前才接的。”我对安妮说。

source: "Never could tell the twins apart," Annie said, out of nowhere.
zh_cn: “这对双胞胎我从来就没分清过。”安妮没由头地说。

source: "I don't believe that," I said to her.
zh_cn: “我看不是吧。”我说。

source: "When we were all in high school together, you had a big crush on one of them."
zh_cn: “那会儿我们上高中，你还迷上过一个呢。”

source: "I certainly did not," she said back to me.
zh_cn: “哪有这事。”

source: "Well, I remember it different," I said.
zh_cn: “没这事？我记得有。”

source: "It was Betty Jo Engborg used to hang around Larry," she said.
zh_cn: “那是贝蒂?乔?恩堡，整天和拉里混在一起。

source: "Or maybe it was Lester."
zh_cn: 哦，也可能是莱斯特。”

source: "Lester was captain of the basketball team," I said.
zh_cn: “莱斯特是篮球队长。

source: "The coach made him wear a red ribbon around his ankle, Larry got a blue one.
zh_cn: 教练让他在脚踝上戴个红色的队长标志，拉里有个蓝的。

source: Larry and I were guards.
zh_cn: 拉里和我打防守。

source: Lester was forward.
zh_cn: 莱斯特打前锋。

source: Some team that was.
zh_cn: 高水平球队啊！

source: Regional champs."
zh_cn: 拿过地区冠军。”

source: "Some people like to live on their past glories," Annie said to me.
zh_cn: “有些人喜欢活在过去的辉煌中。”

source: "Well, Lester got a scholarship to college out of it."
zh_cn: “不过，莱斯特靠打篮球获得的奖学金上了大学。”

source: "That didn't last long," she said.
zh_cn: “没上多久。

source: "The old man had him back in the hay field pretty quick.
zh_cn: 那老头很快就让他回家种牧草。

source: Which one was engaged to be married?"
zh_cn: 有个订了婚，是哪个？”

source: "I don't remember," I said.
zh_cn: “不记得了。

source: "The mother got sick and that was the end of that."
zh_cn: 母亲生病了，婚事就黄了。”

source: "It's just a shame," Annie said, "the two of them, good looking boys, living their whole lives out there on that old farm."
zh_cn: “真是太可惜了。英俊的俩小伙子，就在那破旧的农场上过一辈子。”

source: "Their mother was one of those whiners," I said.
zh_cn: “他们母亲爱抱怨。”我说。

source: "She had plenty to whine about," Annie snapped back.
zh_cn: “她可以抱怨的事确实很多。”安妮飞快地接话。

source: "The old man never spent a nickel on anything except the cows."
zh_cn: “那老头钱都花在奶牛身上，其他地方一分钱也不给。”

source: "At least their driveway is plowed out today," I said as we passed their mail box sticking up out of the snow bank.
zh_cn: “不过，他们家的车道今天倒是请扫雪机扫了。”

source: We could see the flames shooting out the roof as we headed up their driveway.
zh_cn: 车开过立在雪墙中的邮箱，一上车道，我们就看见火焰冲出屋顶。

source: "We're going to park out there by the cow sheds to leave room for the fire engines," I said.
zh_cn: “我们把车停到牛舍那边，给消防车留出地方。”我说。

source: "Look," Annie said, "there's one of them sitting there by that tree.
zh_cn: “看。有个兄弟坐在那边树下面。

source: Just sitting there holding a box.
zh_cn: 干坐在那儿，手里抓着一个箱子。”

source: "Which one is it?'
zh_cn: “是哪个？”

source: "That's a dumb question," Annie said.
zh_cn: “问得真傻。”安妮说。

source: She was right, of course.
zh_cn: 确实傻，她说的没错。

source: When we were all younger, I could generally tell them apart.
zh_cn: 我们年轻的时候，我分清他俩不难。

source: But over the years, they just got to looking more and more alike.
zh_cn: 这么多年来，两个人越长越像。

source: Some twins seem to develop different habits, but not Lester or Larry.
zh_cn: 有些双胞胎长大后性格反差很大，莱斯特和拉里不是这样。

source: It's always been a bother to me. I never know what to say when I meet one of them at the general store in the morning.
zh_cn: 早上杂货店遇上一个，都不知道怎么称呼，这让我一直很头疼。

source: Annie was high-tailing it over to the tree, and by the time I got there she was talking to him.
zh_cn: 安妮一下车连忙向树下跑去。我赶到时，她在问他话。

source: "Where's your brother?" she was asking him, but he was staring out toward the horse corral mute as a mole.
zh_cn: “你兄弟呢？”他盯着马厩，一言不发。

source: "Are you Lester or Larry?" she asked.
zh_cn: “你是莱斯特还是拉里？”她又问。

source: He didn't answer.
zh_cn: 他不回答。

source: "Are you Lester?" she asked him.
zh_cn: “你是莱斯特？”她又问。

source: He still didn't say a word.
zh_cn: 他还是不说话。

source: I left them and ran toward the house.
zh_cn: 我离开他们，朝房子跑去。

source: By now the fire engine was coming up the driveway, but I was aiming to find the other twin.
zh_cn: 这时消防车开上车道。我不管，一心只想找到另外一个双胞胎。

source: Most of the fire was in the back, and the front of the house was standing there looking normal.
zh_cn: 火势集中在房子的后半部，前半部跟平常没什么两样。

source: Of course, nobody living in the country ever uses the front door, so I had to wade through the snow banks to get to it and then I had to push like hell to get the door open.
zh_cn: 乡村的人没有走前门的。我费力跨过雪墙来到门前，用尽最后一丝力气才把门打开。

source: I should have known better than to do that, because when the door opened up it let in a cross draft of air that set off a ball of fire inside that house, roaring like a tornado moving across the prairie.
zh_cn: 门一开我就后悔了。穿堂风刮进来，屋里炸起一个火球，轰隆隆像龙卷风刮过草原。

source: One of those twins was sitting naked except for a pair of work boots, tied up hands and feet to a chair.
zh_cn: 一个双胞胎全身赤裸、脚上穿着工作长靴，双手双脚绑在一张椅子上。

source: He was struggling to get loose.
zh_cn: 他正在努力挣脱，可是越挣越紧。

source: I got out of there with my eyebrows singed off. The fur on my parka burned down to black nubs.
zh_cn: 我转身走出门。眉毛烧焦了，皮大衣上的毛熔化了，一个疙瘩一个疙瘩的。

source: I staggered back over to the tree where Annie was still talking to the other twin. When she looked up she said, "You alright?"
zh_cn: 我跌跌撞撞地回到树下。安妮还在问那个双胞胎话，抬头看到我问：“没事吧？”

source: There was no time for complaining, so I just asked her, "What does he say?"
zh_cn: 没时间向她解释，我问她：“他说了什么？”

source: "Nothing," she said, "he won't say a thing."
zh_cn: “啥也没说，一字不讲。”她答。

source: "What you got in the box?" I asked him.
zh_cn: “箱子里装的什么？”我问他。

source: "Looks like a money box," Annie said.
zh_cn: “像是个钱箱。”安妮说。

source: "What happened? I asked him.
zh_cn: “发生了什么事？”我又问他。

source: He just sat there holding the box.
zh_cn: 他僵坐着，抓着箱子。

source: I didn't say anything to Annie about what I'd seen.
zh_cn: 我没把刚才看到的告诉安妮，不想让她心烦。

source: Didn't want to upset her, but when the fire engine finally got there, I had to tell them.
zh_cn: 消防车到了，我得告诉他们。

source: They did their best to get into that house, but it was hopeless.
zh_cn: 他们想尽办法才进屋了，但是为时已晚。

source: Gordy Borlaug, the deputy sheriff, and a couple of state troopers came driving up along with a few nearby neighbors.
zh_cn: 副警长戈迪布劳格带着几名警察，还有几个附近的邻居开着车来了。

source: "Where's the other one?" they all were asking, and everybody tried to get the one twin to speak, but he never opened his mouth.
zh_cn: “另外一个呢？”他们都在问，想让树下的这个双胞胎说话。可是他嘴唇一动也不动。

source: It was Annie that finally got him to at least let go of the box, and when she went to take it off his lap, she could hardly lift it.
zh_cn: 后来还是安妮让他松开箱子。她把箱子从他膝盖上拿下来，差点儿摔到地上。

source: I went over to help.
zh_cn: 我走过去帮她。

source: It was quite a sight when we opened it by the light of that fire.
zh_cn: 就着火光，我们打开箱子，耀眼的光彩照射出来。

source: Full of gold bars.
zh_cn: 满满一箱金锭。

source: I counted them out one by one so that everybody would know what was in there, just in case the authorities decided they should take it away for evidence or something like that.
zh_cn: 我一块一块数出来，好让大家都看清楚。警方可能会拿走作为证物，或者其他用途。

source: Twenty bars. Pretty as a picture.
zh_cn: 二十块金锭，光彩夺目。

source: There wasn't much they could do with a fire engine, except use what water they had with them to keep the sparks from spreading fire to the outbuildings.
zh_cn: 消防车也无能为力，只能用车上的水来防止火花窜到相邻的房子。

source: Of course I told Gordy what I'd seen, but he didn't seem to know what to do about it.
zh_cn: 我把看到的跟戈迪讲了，他似乎也不知道该怎么办。

source: He did get some blankets and wrapped the twin up in them and put him in his car.
zh_cn: 他找到一张毯子把房子里的那个双胞胎裹在里面，放到他的车上。

source: "What you going to do with him?" I asked.
zh_cn: “他怎么办？”我问。

source: "Jeez, I don't know," Gordy said.
zh_cn: “哎呀，我也不知道。

source: "There'll have to be an investigation.
zh_cn: 肯定要先调查。

source: Everybody's getting cabin fever.
zh_cn: 大家窝在家里窝出了问题。

source: This is the third thing this month.
zh_cn: 这个月第三起了。

source: You must have heard about what happened over there near Canfield, with the mother-in-law."
zh_cn: 离这儿不远的坎菲尔德那起你听说了吧，婆婆也在的那家。”他说。

source: "Yeah," I said.
zh_cn: “听说了。”我答。

source: "Are you sure about what you saw in that house?" he asked me.
zh_cn: “房子里面你没看错吧？”他问。

source: "Mighty strange sight," I said, and then I took to shivering over my whole body.
zh_cn: “绝对错不了。”我答道，全身禁不住打了个寒战。

source: Annie came over and laid her hand on my shoulder. "We better get home, Brady," she said.
zh_cn: 安妮走过来，把一只手搭在我的肩上，说：“我们回家吧，布拉迪。

source: "I'm about to freeze to death standing up."
zh_cn: 站这儿快冻僵了。”

source: Gordy said," I guess I'll have to take him to the jailhouse.
zh_cn: 戈迪说：“我看，我们得把他带到监狱。

source: Don't know what else to do with him."
zh_cn: 其他也不能拿他怎么样。”

source: The next morning at the general store there was plenty to talk about, and a lot of theories about what happened.
zh_cn: 第二天早上，杂货店里好多人都在谈论这件事，各种各样的说法都有。

source: There were those who were sure it was Larry who had tied his brother up to a chair and set fire to the house, but the opposition had a lot of reasons for naming Lester.
zh_cn: 有些说是拉里把他兄弟捆在椅子上然后把房子点着了。但是反对这种说法，说是莱斯特干的人也有很多理由。

source: And then, there were those who thought it was some stranger who sneaked up in the dark looking for money, or a no-good nephew named Orville who lived down in Fargo, or a husband of one of the cousins who, it was rumored, might have a drug problem.
zh_cn: 又有人说，是外人乘天黑溜进来偷钱。还可能是他们住在法戈（译者：美国北达科他州东南部城市）侄子奥维尔干的，这人品行不端。要不就是他们一个表姐妹的男人干的，传说那个人有毒瘾。

source: Later that week, when I heard that the twin was still sleeping in the jailhouse, I took it on myself to go in and see about it.
zh_cn: 那个星期靠后几天，我听说那个双胞胎还在监狱里，觉得应该去看看他。

source: There weren't any relatives he could count on.
zh_cn: 他的亲戚没有一个是他可以依靠的。

source: He was sitting in this overheated cell.
zh_cn: 他坐在很热的牢房里。

source: They told me he was still not speaking a word.
zh_cn: 他们说，到现在他都没有说一个字。

source: They let me in to talk to him, and I said to him, as if we had been carrying a conversation for some time and this was the next sentence, "That year when Lacy High School took the regional basketball championship and you were the captain, how many points did you score that final game?"
zh_cn: 他们让我进去和他谈。我随意问了他一句话，就像我们已经谈了很长时间后问的那样。“那年，地区篮球锦标赛莱西高中夺冠，你当的队长呢，决赛你拿了几分？”

source: "Thirty-eight," he said.
zh_cn: “38分。”他说。

source: "Well, Lester," I said, "I'm going to get you out of here and take you home.
zh_cn: “哎，莱斯特，我把你弄出来，住我家。

source: Annie will fry up some chicken, and you can sleep down in the rec room until we get this thing sorted out."
zh_cn: 安妮煎鸡肉我们吃。你睡下面的康乐室，等我们把这事解决妥当了。”我说。

source: I never did tell anybody, except for Annie, which twin was sleeping down there in our rec room.
zh_cn: 住我家康乐室的双胞胎是哪一个，我谁都没告诉，除了安妮。

source: And I told her that if she told anybody I'd divorce her, forty years or no forty years.
zh_cn: 我说，她要是告诉了别人，就离婚，四十年的情分我都不会顾及。

source: And she knew I meant it.
zh_cn: 她知道我不是随便说说的。

source: There was an investigation and a lot of comings and goings.
zh_cn: 警方做调查，人来人往，一波又一波。

source: I had to tell the authorities what I saw, but in the end, Lester was just let go.
zh_cn: 我把看到的都告诉了警方，后来，莱斯特给放了。

source: The fact is they couldn't come up with what they needed for an indictment, and, to tell the truth, there didn't seem to be much enthusiasm for putting him into a jail cell, whichever twin he was.
zh_cn: 实情是，警方找不到足够的证据起诉他。另外我看得出来，他们也不是非要把他关进监狱不可，不管活着的双胞胎是哪一个。
